### Terraform Environment Changes "prod"
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...
data.terraform_remote_state.shared: Reading...
random_password.database: Refreshing state... [id=none]
zitadel_project.project: Refreshing state... [id=181236602041794817]
zitadel_machine_user.api-access: Refreshing state... [id=184905819228209409]
google_secret_manager_secret.api-auth-jwt: Refreshing state... [id=projects/ost-cas-adv-fee/secrets/qwacker-api-prod-api-auth-jwt]
google_secret_manager_secret.storage-access: Refreshing state... [id=projects/ost-cas-adv-fee/secrets/qwacker-api-prod-storage-access]
data.google_iam_policy.noauth: Reading...
data.google_project.project: Reading...
google_storage_bucket.gcs-bucket: Refreshing state... [id=qwacker-api-prod-data]
google_secret_manager_secret.api-access-pat: Refreshing state... [id=projects/ost-cas-adv-fee/secrets/qwacker-api-prod-api-access-pat]
data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_secret_manager_secret.db-pass: Refreshing state... [id=projects/ost-cas-adv-fee/secrets/qwacker-api-prod-db-pass]
google_service_account.gcs-access: Refreshing state... [id=projects/ost-cas-adv-fee/serviceAccounts/qwacker-api-prod-gcs@ost-cas-adv-fee.iam.gserviceaccount.com]
google_secret_manager_secret_version.db-pass: Refreshing state... [id=projects/714602723919/secrets/qwacker-api-prod-db-pass/versions/1]
google_service_account_key.gcs-access-key: Refreshing state... [id=projects/ost-cas-adv-fee/serviceAccounts/qwacker-api-prod-gcs@ost-cas-adv-fee.iam.gserviceaccount.com/keys/d21bce48927f620c484747373417a16a12303a1b]
google_secret_manager_secret_version.storage-access: Refreshing state... [id=projects/714602723919/secrets/qwacker-api-prod-storage-access/versions/1]
data.google_project.project: Read complete after 1s [id=projects/ost-cas-adv-fee]
zitadel_application_api.api: Refreshing state... [id=181236603669184769]
zitadel_application_oidc.frontend: Refreshing state... [id=181236603920843009]
google_storage_bucket_iam_member.gcs-bucket: Refreshing state... [id=b/qwacker-api-prod-data/roles/storage.objectViewer/allUsers]
google_storage_bucket_iam_member.gcs-iam: Refreshing state... [id=b/qwacker-api-prod-data/roles/storage.admin/serviceAccount:qwacker-api-prod-gcs@ost-cas-adv-fee.iam.gserviceaccount.com]
zitadel_personal_access_token.api-access: Refreshing state... [id=184905821174366465]
zitadel_org_member.api-access: Refreshing state... [id=179828644300980481_184905819228209409]
zitadel_application_key.app-key: Refreshing state... [id=181236605145579777]
google_secret_manager_secret_version.api-access-pat: Refreshing state... [id=projects/714602723919/secrets/qwacker-api-prod-api-access-pat/versions/1]
google_secret_manager_secret_version.api-auth-jwt: Refreshing state... [id=projects/714602723919/secrets/qwacker-api-prod-api-auth-jwt/versions/2]
data.terraform_remote_state.shared: Read complete after 3s
google_secret_manager_secret_iam_member.api-access-pat: Refreshing state... [id=projects/714602723919/secrets/qwacker-api-prod-api-access-pat/roles/secretmanager.secretAccessor/serviceAccount:cloud-runner@ost-cas-adv-fee.iam.gserviceaccount.com]
google_sql_database.db: Refreshing state... [id=projects/ost-cas-adv-fee/instances/qwacker-api-pgsql-14/databases/qwacker-api-prod]
google_sql_user.db-user: Refreshing state... [id=qwacker-api-prod//qwacker-api-pgsql-14]
google_secret_manager_secret_iam_member.storage-access: Refreshing state... [id=projects/714602723919/secrets/qwacker-api-prod-storage-access/roles/secretmanager.secretAccessor/serviceAccount:cloud-runner@ost-cas-adv-fee.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.db-pass: Refreshing state... [id=projects/714602723919/secrets/qwacker-api-prod-db-pass/roles/secretmanager.secretAccessor/serviceAccount:cloud-runner@ost-cas-adv-fee.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.api-auth-jwt: Refreshing state... [id=projects/714602723919/secrets/qwacker-api-prod-api-auth-jwt/roles/secretmanager.secretAccessor/serviceAccount:cloud-runner@ost-cas-adv-fee.iam.gserviceaccount.com]
google_cloud_run_service.api["http"]: Refreshing state... [id=locations/europe-west6/namespaces/ost-cas-adv-fee/services/qwacker-api-http-prod]
google_cloud_run_service.api["grpc"]: Refreshing state... [id=locations/europe-west6/namespaces/ost-cas-adv-fee/services/qwacker-api-grpc-prod]
google_cloud_run_service.grpcwebproxy: Refreshing state... [id=locations/europe-west6/namespaces/ost-cas-adv-fee/services/qwacker-api-grpcwebproxy-prod]
google_cloud_run_service_iam_policy.noauth["http"]: Refreshing state... [id=v1/projects/ost-cas-adv-fee/locations/europe-west6/services/qwacker-api-http-prod]
google_cloud_run_service_iam_policy.noauth["grpc"]: Refreshing state... [id=v1/projects/ost-cas-adv-fee/locations/europe-west6/services/qwacker-api-grpc-prod]
google_cloud_run_service_iam_policy.noauth["grpcweb"]: Refreshing state... [id=v1/projects/ost-cas-adv-fee/locations/europe-west6/services/qwacker-api-grpcwebproxy-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_service.api["grpc"] will be updated in-place
  ~ resource "google_cloud_run_service" "api" {
        id                         = "locations/europe-west6/namespaces/ost-cas-adv-fee/services/qwacker-api-grpc-prod"
        name                       = "qwacker-api-grpc-prod"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west6-docker.pkg.dev/ost-cas-adv-fee/qwacker-api-docker/cas-fee-adv-qwacker-api:1.13.0" -> "europe-west6-docker.pkg.dev/ost-cas-adv-fee/qwacker-api-docker/cas-fee-adv-qwacker-api:0.0.0-plan-preview"
                    # (2 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (16 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.api["http"] will be updated in-place
  ~ resource "google_cloud_run_service" "api" {
        id                         = "locations/europe-west6/namespaces/ost-cas-adv-fee/services/qwacker-api-http-prod"
        name                       = "qwacker-api-http-prod"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west6-docker.pkg.dev/ost-cas-adv-fee/qwacker-api-docker/cas-fee-adv-qwacker-api:1.13.0" -> "europe-west6-docker.pkg.dev/ost-cas-adv-fee/qwacker-api-docker/cas-fee-adv-qwacker-api:0.0.0-plan-preview"
                    # (2 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (16 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.grpcwebproxy will be updated in-place
  ~ resource "google_cloud_run_service" "grpcwebproxy" {
        id                         = "locations/europe-west6/namespaces/ost-cas-adv-fee/services/qwacker-api-grpcwebproxy-prod"
        name                       = "qwacker-api-grpcwebproxy-prod"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west6-docker.pkg.dev/ost-cas-adv-fee/qwacker-api-docker/cas-fee-adv-qwacker-grpcwebproxy:1.13.0" -> "europe-west6-docker.pkg.dev/ost-cas-adv-fee/qwacker-api-docker/cas-fee-adv-qwacker-grpcwebproxy:0.0.0-plan-preview"
                    # (2 unchanged attributes hidden)

                    # (2 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_secret_manager_secret_iam_member.api-access-pat must be replaced
-/+ resource "google_secret_manager_secret_iam_member" "api-access-pat" {
      ~ etag      = "BwX26jBiyCM=" -> (known after apply)
      ~ id        = "projects/714602723919/secrets/qwacker-api-prod-api-access-pat/roles/secretmanager.secretAccessor/serviceAccount:cloud-runner@ost-cas-adv-fee.iam.gserviceaccount.com" -> (known after apply)
      ~ project   = "714602723919" -> (known after apply)
      ~ secret_id = "projects/714602723919/secrets/qwacker-api-prod-api-access-pat" -> "projects/714602723919/secrets/qwacker-api-prod-api-access-pat/versions/1" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_secret_manager_secret_iam_member.api-auth-jwt must be replaced
-/+ resource "google_secret_manager_secret_iam_member" "api-auth-jwt" {
      ~ etag      = "BwX26jBiyOg=" -> (known after apply)
      ~ id        = "projects/714602723919/secrets/qwacker-api-prod-api-auth-jwt/roles/secretmanager.secretAccessor/serviceAccount:cloud-runner@ost-cas-adv-fee.iam.gserviceaccount.com" -> (known after apply)
      ~ project   = "714602723919" -> (known after apply)
      ~ secret_id = "projects/714602723919/secrets/qwacker-api-prod-api-auth-jwt" -> "projects/714602723919/secrets/qwacker-api-prod-api-auth-jwt/versions/2" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_secret_manager_secret_iam_member.db-pass must be replaced
-/+ resource "google_secret_manager_secret_iam_member" "db-pass" {
      ~ etag      = "BwX26jBhuio=" -> (known after apply)
      ~ id        = "projects/714602723919/secrets/qwacker-api-prod-db-pass/roles/secretmanager.secretAccessor/serviceAccount:cloud-runner@ost-cas-adv-fee.iam.gserviceaccount.com" -> (known after apply)
      ~ project   = "714602723919" -> (known after apply)
      ~ secret_id = "projects/714602723919/secrets/qwacker-api-prod-db-pass" -> "projects/714602723919/secrets/qwacker-api-prod-db-pass/versions/1" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_secret_manager_secret_iam_member.storage-access must be replaced
-/+ resource "google_secret_manager_secret_iam_member" "storage-access" {
      ~ etag      = "BwX26jBet04=" -> (known after apply)
      ~ id        = "projects/714602723919/secrets/qwacker-api-prod-storage-access/roles/secretmanager.secretAccessor/serviceAccount:cloud-runner@ost-cas-adv-fee.iam.gserviceaccount.com" -> (known after apply)
      ~ project   = "714602723919" -> (known after apply)
      ~ secret_id = "projects/714602723919/secrets/qwacker-api-prod-storage-access" -> "projects/714602723919/secrets/qwacker-api-prod-storage-access/versions/1" # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 3 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>